In [1]:
# (15-09-2022) Thursday

# Let's Explore:

**Roland's Breach, Pyrenees, France**

<img src='https://www.bing.com/th?id=ABT5F52740B35EBAF1603E79EA48F660E9363D357B49DB4CE8504038EB6A761A869&w=608&h=200&c=2&rs=1&o=6&pid=SANGAM'>

The Milky Way looks like it is pouring into this giant gap, Roland’s Breach, high in the Pyrenees on the border of France and Spain. This towering natural wonder is 40 metres wide and about 70 metres deep and found on the outskirts of the famous Cirque de Garvarnie – a spectacular amphitheatre-like cliff face, from which numerous waterfalls pour.

According to legend, Roland’s Breach was created by the famous knight who served Charlemagne, the first Holy Roman Emperor. The story goes that Roland tried to destroy his sword, Durandal, after being defeated in the Battle of Roncevaux Pass in 778 CE, creating the opening in the rock face. Found at an altitude of 2,807 metres, these days Roland’s Breach and the Cirque de Gavarnie are popular destinations for experienced hikers keen to experience one of France’s most stunning natural attractions.

In [2]:
#Revision of list comprehension:

In [3]:
List1 = ['A' if i%2==0 else 'B' for i in range(10)]

In [4]:
List1

['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B', 'A', 'B']

In [5]:
#Starts from here:

In [6]:
import pandas as pd

In [7]:
import numpy as np

In [8]:
df = {}
df['Column1'] = np.arange(10)
df['Column2'] = np.arange(10,20)
df

{'Column1': array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 'Column2': array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])}

In [9]:
df = pd.DataFrame(df)
df

   Column1  Column2
0        0       10
1        1       11
2        2       12
3        3       13
4        4       14
5        5       15
6        6       16
7        7       17
8        8       18
9        9       19

#### Fetch the row from the data frame where the value is less than 2.

In [10]:
df[df['Column1']<2]

   Column1  Column2
0        0       10
1        1       11

In [11]:
result = pd.DataFrame({"student_name":['Noah', 'Nasir', 'Salis','Jibrael', 'Abdullah'],
                       "student_roll":[1,2,3,4,5,],
                      "Paper1":[90,89,78,76,65],
                      "Paper2":[80,99,78,78,55],
                      "Paper3":[60,49,68,86,95]})

In [12]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Noah             1      90      80      60
1        Nasir             2      89      99      49
2        Salis             3      78      78      68
3      Jibrael             4      76      78      86
4     Abdullah             5      65      55      95

In [13]:
result['Total'] = result['Paper1'] + result['Paper2'] + result['Paper3']

In [14]:
result['Percentage'] = result['Total']/300*100

In [15]:
result

  student_name  student_roll  Paper1  Paper2  Paper3  Total  Percentage
0         Noah             1      90      80      60    230   76.666667
1        Nasir             2      89      99      49    237   79.000000
2        Salis             3      78      78      68    224   74.666667
3      Jibrael             4      76      78      86    240   80.000000
4     Abdullah             5      65      55      95    215   71.666667

In [16]:
result['LC_Grade'] = ['A' if num >= 80 else 'B' if num >= 75 else 'C' for num in result['Percentage']]
result

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade
0,Noah,1,90,80,60,230,76.666667,B
1,Nasir,2,89,99,49,237,79.000000,B
2,Salis,3,78,78,68,224,74.666667,C
3,Jibrael,4,76,78,86,240,80.000000,A
4,Abdullah,5,65,55,95,215,71.666667,C

In [17]:
def grade(num):
    
    grade = None
    if num >=80:
        grade = 'A'
    elif num >=75:
        grade =  'B'
    else:
        grade =  'C'
    return grade

In [18]:
result['func_Grade'] = [grade(num) for num in result['Percentage']]
result

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade,func_Grade
0,Noah,1,90,80,60,230,76.666667,B,B
1,Nasir,2,89,99,49,237,79.000000,B,B
2,Salis,3,78,78,68,224,74.666667,C,C
3,Jibrael,4,76,78,86,240,80.000000,A,A
4,Abdullah,5,65,55,95,215,71.666667,C,C

LOC and ILOC:
    
   * Loc: Catching Row
   * ILoc: Catching Column

In [19]:
result.loc[2]

student_name        Salis
student_roll            3
Paper1                 78
Paper2                 78
Paper3                 68
Total                 224
Percentage      74.666667
LC_Grade                C
func_Grade              C
Name: 2, dtype: object

In [20]:
result.iloc[3]

student_name    Jibrael
student_roll          4
Paper1               76
Paper2               78
Paper3               86
Total               240
Percentage         80.0
LC_Grade              A
func_Grade            A
Name: 3, dtype: object

In [21]:
result[result['student_name']=='Noah']

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade,func_Grade
0,Noah,1,90,80,60,230,76.666667,B,B

In [22]:
result[result['student_name']=='Noah']['LC_Grade']

0    B
Name: LC_Grade, dtype: object

In [23]:
result[result['student_name']=='Noah'][['student_name','LC_Grade']]

  student_name LC_Grade
0         Noah        B

In [24]:
result[result['student_name']=='Noah'][['student_name','Total','LC_Grade']]

  student_name  Total LC_Grade
0         Noah    230        B

In [25]:
result[['student_name','Total','LC_Grade']]

  student_name  Total LC_Grade
0         Noah    230        B
1        Nasir    237        B
2        Salis    224        C
3      Jibrael    240        A
4     Abdullah    215        C

In [26]:
result['Paper1'].min()

65

In [27]:
result['Paper2'].max()

99

In [28]:
min(result['Paper1'])

65

In [29]:
result[result['Paper1'] == result['Paper1'].min()]

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade,func_Grade
4,Abdullah,5,65,55,95,215,71.666667,C,C

In [30]:
result[result['Paper2'] == result['Paper2'].max()]

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade,func_Grade
1,Nasir,2,89,99,49,237,79.0,B,B

In [31]:
result[result['Paper2'] == result['Paper2'].max()][['student_name','Paper2']]

  student_name  Paper2
1        Nasir      99

In [32]:
result[result['Paper1'] == result['Paper1'].min()][['student_name','Paper1']]

  student_name  Paper1
4     Abdullah      65

In [33]:
result[['Paper1','Paper2']].max()

Paper1    90
Paper2    99
dtype: int64

In [34]:
result[['student_name','Paper2']].max()

student_name    Salis
Paper2             99
dtype: object

In [35]:
result[['student_name','Paper1','Paper2']].max()

student_name    Salis
Paper1             90
Paper2             99
dtype: object

In [36]:
result[result['student_name'] == 'Salis']

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade,func_Grade
2,Salis,3,78,78,68,224,74.666667,C,C

In [37]:
result[result['student_name'] == 'Abdullah'].replace('Abdullah','Abdullah1')

,student_name,student_roll,Paper1,Paper2,Paper3,Total,Percentage,LC_Grade,func_Grade
4,Abdullah1,5,65,55,95,215,71.666667,C,C

In [38]:
#Done